; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v3 ?v10)
             (pred_2 ?v1 ?v12)
             (pred_4 ?v3 ?v12)
             (pred_12 ?v9 ?v3 )
	     (pred_5 ?v3)
             (pred_1 ?v8)
             (pred_10 ?v1)
             (pred_9 ?v12)
             (pred_6 ?v3)
             (pred_7 ?v1)
             (pred_3 ?v3)
             (pred_8 ))



(:action op_2
:parameters (?v11 ?v2 ?v4 ?v7)
:precondition (and (pred_1 ?v11) (pred_1 ?v2) (pred_10 ?v4) (pred_9 ?v7)
          (pred_11 ?v11 ?v2) (pred_2 ?v4 ?v7)
                   (pred_4 ?v2 ?v7) (pred_5 ?v11) 
                   (pred_6 ?v2) (pred_7 ?v4))
:effect (and  (pred_3 ?v2) (not (pred_6 ?v2))))


(:action op_3
:parameters (?v11 ?v13)
:precondition (and (pred_1 ?v11) (pred_1 ?v13)
               (pred_5 ?v11) (pred_11 ?v11 ?v13) (pred_3 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v11))))

(:action op_1
:parameters (?v11 ?v4)
:precondition (and (pred_1 ?v11) (pred_10 ?v4) 
                  (pred_5 ?v11) (pred_12 ?v4 ?v11) (pred_8 ))
:effect (and (pred_7 ?v4)
   (not (pred_12 ?v4 ?v11)) (not (pred_8 ))))


(:action op_5
:parameters (?v11 ?v5 ?v6)
:precondition (and (pred_1 ?v11) (pred_10 ?v5) (pred_10 ?v6)
                  (pred_5 ?v11) (pred_7 ?v6) (pred_12 ?v5 ?v11))
:effect (and (pred_7 ?v5) (pred_12 ?v6 ?v11)
        (not (pred_7 ?v6)) (not (pred_12 ?v5 ?v11))))

(:action op_4
:parameters (?v11 ?v4)
:precondition (and (pred_1 ?v11) (pred_10 ?v4) 
                  (pred_5 ?v11) (pred_7 ?v4))
:effect (and (pred_8 ) (pred_12 ?v4 ?v11) (not (pred_7 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_09 obj_07 obj_14 obj_16 obj_12 obj_20 obj_15 obj_01 obj_13 obj_02 obj_17 obj_10 obj_06 obj_08 obj_18
    obj_05 obj_03
    obj_04 obj_19
    )

    (:init
       (pred_8)

       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_16)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_9 obj_05)
       (pred_9 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_19)

       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_18 obj_08)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_4  obj_18 obj_05)
       (pred_4  obj_10 obj_03)
       (pred_3 obj_11)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_16)
       (pred_3 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_3 obj_08)

       (pred_2  obj_04 obj_05)
       (pred_2  obj_19 obj_03)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_19 obj_16)
       (pred_5 obj_15)
    )

    (:goal (and
       (pred_12 obj_19 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_20)))
)
)

; plan
1. (op_3 obj_15 obj_14)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_14)
   goals met: 0 of 1
2. (op_3 obj_14 obj_07)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_09)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_11)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_11)
   goals met: 0 of 1
5. (op_3 obj_11 obj_16)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_16)
   goals met: 0 of 1
6. (op_1 obj_16 obj_19)
   deleted: (pred_12 obj_19 obj_16) (pred_8)
   added: (pred_7 obj_19)
   goals met: 0 of 1
7. (op_3 obj_16 obj_11)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_11)
   goals met: 0 of 1
8. (op_3 obj_11 obj_09)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_09)
   goals met: 0 of 1
9. (op_3 obj_09 obj_07)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_07)
   goals met: 0 of 1
10. (op_4 obj_07 obj_19)
   deleted: (pred_7 obj_19)
   added: (pred_8) (pred_12 obj_19 obj_07)
   goals met: 1 of 1
